In [74]:
import matplotlib.pyplot as plt
import pandas as pd
import pylab as pl
from sklearn import linear_model
from sklearn.model_selection import train_test_split
import numpy as np
from sklearn import metrics
from word2number import w2n
%matplotlib inline

In [22]:
sal=pd.read_csv("salary.csv")
sal.rename(columns = {'experience':'exp','test_score(outof10)':'tscore','Interview_score(outof10)':'iscore','salary($)':'salary'},inplace=True)

  experience  test_score(outof10)  Interview_score(outof10)  salary($)
0        NaN                  8.0                         9      50000
1        NaN                  8.0                         6      45000
2       five                  6.0                         7      60000
3        two                 10.0                        10      65000
4      seven                  9.0                         6      70000
5      three                  7.0                        10      62000
6        ten                  NaN                         7      72000
7     eleven                  7.0                         8      80000

In [87]:
### I Just put the experience in words with number use index value ################
sal.at[6,'tscore']=7
sal

  exp  tscore  iscore  salary
0   0     8.0       9   50000
1   0     8.0       6   45000
2   5     6.0       7   60000
3   2    10.0      10   65000
4   7     9.0       6   70000
5   3     7.0      10   62000
6  10     7.0       7   72000
7  11     7.0       8   80000

In [89]:
sal

  exp  tscore  iscore  salary
0   0     8.0       9   50000
1   0     8.0       6   45000
2   5     6.0       7   60000
3   2    10.0      10   65000
4   7     9.0       6   70000
5   3     7.0      10   62000
6  10     7.0       7   72000
7  11     7.0       8   80000

In [90]:
sal.columns

Index(['exp', 'tscore', 'iscore', 'salary'], dtype='object')

In [91]:
df_output=sal['salary']
df_input=sal[['exp', 'tscore', 'iscore']]
feature_columns=['exp', 'tscore', 'iscore']

In [92]:
###########Running the Linear Regeression initilising Variables first 
reg =linear_model.LinearRegression()
X_train, X_test, y_train, y_test = train_test_split(df_input, df_output, random_state=123,test_size=.6)
print("The No of Rows Columns in X_Train is which is based on test_size(.8) given earlier",X_train.shape)
print("The No of Rows Columns in X_test is which is based on test_size(.8) given earlier",X_test.shape)
print("The No of Rows Columns in y_train is which is based on test_size(.8) given earlier",y_train.shape)
print("The No of Rows Columns in y_test is which is based on test_size(.8) given earlier",y_test.shape)

The No of Rows Columns in X_Train is which is based on test_size(.8) given earlier (3, 3)
The No of Rows Columns in X_test is which is based on test_size(.8) given earlier (5, 3)
The No of Rows Columns in y_train is which is based on test_size(.8) given earlier (3,)
The No of Rows Columns in y_test is which is based on test_size(.8) given earlier (5,)

In [93]:
reg.fit(X_train,y_train)
y_pred = reg.predict(X_test)
print(y_pred,type(y_pred))
print(np.sqrt(metrics.mean_squared_error(y_test, y_pred)))
print("reg.coef=>",reg.coef_,"reg.intercept_=>",reg.intercept_)

[55060.07067138 49971.73144876 63512.36749117 75851.59010601
 66282.68551237] <class 'numpy.ndarray'>
4088.1098548801947
reg.coef=> [2155.4770318  1222.61484099 1696.1130742 ] reg.intercept_=> 30014.134275618388

In [95]:
print("reg.coef=>",reg.coef_,"reg.intercept_=>",reg.intercept_)
print(list(zip(feature_columns, reg.coef_)))
print("###########################")
print("Salary Pridction")
print(reg.predict([[12,10,10]]))
print(reg.predict([[2,9,6]]))

reg.coef=> [2155.4770318  1222.61484099 1696.1130742 ] reg.intercept_=> 30014.134275618388
[('exp', 2155.4770318021197), ('tscore', 1222.6148409893988), ('iscore', 1696.1130742049459)]
###########################
Salary Pridction
[85067.13780919]
[55505.30035336]

In [96]:
2*2155.4770318021197 + 9*1222.61484099 + 6*1696.1130742  + 30014.134275618388

55505.30035333263

In [98]:
a=reg.predict(X_test)
####Just Converting the Dataframe to array for result comparision
Y_test=np.array(y_test.values)
######### Calculate the Mean Square Error 
print(np.mean((a-y_test)**2))
for no in range(0,len(a)):
    print("Pridcited ",a[no], " Actual Value",Y_test[no],"Error Value=>",a[no]-Y_test[no])

16712642.185568566
Pridcited  55060.07067137809  Actual Value 50000 Error Value=> 5060.070671378089
Pridcited  49971.731448763254  Actual Value 45000 Error Value=> 4971.731448763254
Pridcited  63512.36749116608  Actual Value 65000 Error Value=> -1487.6325088339217
Pridcited  75851.59010600706  Actual Value 80000 Error Value=> -4148.409893992939
Pridcited  66282.68551236749  Actual Value 70000 Error Value=> -3717.3144876325096